[
  {
    "title": "Intercity Trains | Intercity Rail Solutions | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/intercity-trains/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nRolling Stock Banner Intercity (1920X600)\nIntercity Trains\nGetting passengers to their destination in comfort and style.\n\nOur intercity trains are designed to get passengers to their destination in comfort and style. Connecting major cities and offering a viable alternative to low cost airlines, they are built with the environment in mind and can operate using various sources of power dependant on local infrastructure and restrictions.\n\nClass 800 Series (800-810)\n\nThere are currently 182 intercity trains in service, running the length and breadth of the UK, from Penzance to the Highlands, delivering more seats, modern interiors and faster journey times for millions of passengers.\n\nOur intercity trains can be either fully electric or bi-mode. The bi-mode capability is a world-leading innovation, which allows the train to switch seamlessly between diesel and electric power joining people and communities on electrified and non-electrified routes.\n\nOur intercity train is like no ...\n\nRead more\nFactsheets\nGallery\nTechnical Outline\nHitachi Rail Intercity fleet in service factsheet Hitachi Rail Intercity fleets in service factsheet\nClass 395\n\nIntroduced in 2009, Hitachi’s Class 395 became the first and only high speed passenger train in the UK. Launching a preview service six months ahead of schedule in June 2009, it is a great example of how Hitachi Rail has adapted Japanese bullet-train technology for intercity travel in the UK.\n\nThe ’Javelin’ is still the faste...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nPlay\n00:00\n-02:41\nMute\nSettings\nEnter fullscreen\nNext\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Battery and Hybrid I Global - Hitachi Rail | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/battery-powered-trains/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nRolling Stock Banner Battery (1920X600)\nBattery Powered Trains\nBattery trains: cleaner, quieter and cost effective.\n\nBattery trains reduce carbon emissions and noise, improve air quality at stations, lower maintenance costs and enable flexibility on electrification, minimising passenger disruption during upgrades. As a retrofittable technology with the potential to start small and scale later, it’s the clear sustainable choice for decarbonisation. And, with the fast pace of development, batteries are future-proofed for the expected increases in range, improving their performance.\n\nBattery Powered Trams\n\nHitachi Rail’s battery-powered tram technology offers the major benefit of requiring no electrified infrastructure. Our trams can operate on sections of routes with no overhead wires, such as historic city centres, and offer range increase of up to 5km.\n\nIt’s flexible too. The new technology is based on an Onboard Energy Storage System (OBESS), with scalable battery capacity. It can be installed directly on the roof of existing trams - saving on costs all while ensuring better environmental performance for more sustainable cities.\n\nLearn more here.\n\nGallery\nPrevious\nPlay\n00:00\n-04:56\nMute\nSettings\nEnter fullscreen\nPlay\n00:00\n-04:56\nMute\nSettings\nEnter fullscreen\nPlay\n00:00\n-04:56\nMute\nSettings\nEnter fullscreen\nNext\nBattery Commuter Trains\n\nOur battery powered commuter trains – whether full battery, “hybrid” battery-electric or “tri-brid” battery-electric-diesel - are designed with reliability, sustainability, and efficiency in mind. This new generation of battery hybrid technology brings improved performance across the fleet – lower CO2 output, up to 50% reduction in fuel consumption, lower noise, reduced journey times, and additional power over normal performance.\n\nLearn more here.\n\nGallery\nIntercity Battery Trains\n\nA quick and easy application of battery technology is to install it on existing or future Hitachi intercity trains. Adding just one battery reduces emissions by more than 20% and offers cost savings of 20-30%.\n\nOur intercity battery powered trains can cover 70km on non-electrified routes, operating at intercity speeds at the same or increased performance. Hitachi Rail’s modular design means this can be done without the need to re-engineer or rebuild the train and return them to service as quickly as possible for passengers.\n\nLearn more here.\n\nGallery\nPrevious\nPlay\n00:00\n-02:28\nMute\nSettings\nEnter fullscreen\nNext\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Battery Intercity Train Technical Specification | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/battery-powered-trains/intercity-battery-trains/battery-intercity-train-technical-specification/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nBattery Intercity Train Technical Specification\nHOMEPRODUCTS AND SOLUTIONSBATTERY POWERED TRAINSINTERCITY BATTERY TRAINSBATTERY INTERCITY TRAIN TECHNICAL SPECIFICATION\nA quick and easy application of battery technology is to install it on existing or future Hitachi intercity trains.\n\nAs a climate change innovator, our suite of battery powered trains – for trams, commuter and intercity networks – is already helping reduce CO2 emissions in Japan, Italy, and now the United Kingdom.\n\nOur first UK trail with a battery on an intercity train will pave the way for 100% battery-electric intercity train, capable of running up to 100km in battery mode in the next few years.\n\nHitachi Rail’s modular design means this can be done without the need to re-engineer or rebuild the train and return them to service as quickly as possible for passengers.\n\nDownload our full technical specification product card by completing your details to find out more.\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Battery Commuter Train Technical Specification | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/battery-powered-trains/battery-commuter-trains/battery-commuter-train-technical-specification/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nBattery Commuter Train Technical Specification\nHOMEPRODUCTS AND SOLUTIONSBATTERY POWERED TRAINSBATTERY COMMUTER TRAINSBATTERY COMMUTER TRAIN TECHNICAL SPECIFICATION\nOur battery powered commuter trains – whether full battery, “hybrid” battery-electric or “tri-brid” battery-electric-diesel - are designed with reliability, sustainability, and efficiency in mind.\n\nThis new generation of battery hybrid technology brings improved performance across the fleet – lower CO2 output, up to 50% reduction in fuel consumption, lower noise, reduced journey times, and additional power over normal performance.\n\nCapable of running on both electrified and unelectrified railway lines, these battery powered trains offer greater flexibility for fleet management on regional lines with little to no impact on the existing railway infrastructure.\n\nDownload our full technical specification product card by completing your details to find out more.\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Battery Tram Technical Specification | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/battery-powered-trains/battery-powered-trams/battery-tram-technical-specification/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nBattery Tram Technical Specification\nHOMEPRODUCTS AND SOLUTIONSBATTERY POWERED TRAINSBATTERY POWERED TRAMSBATTERY TRAM TECHNICAL SPECIFICATION\nHitachi Rail’s battery-powered tram technology offers the major benefit of requiring no electrified infrastructure.\n\nOur trams can operate on sections of routes with no overhead wires, such as historic city centres, and offer range increase of up to 5km.\n\nIt’s flexible too. The new technology is based on an Onboard Energy Storage System (OBESS), with scalable battery capacity. It can be installed directly on the roof of existing trams - saving on costs all while ensuring better environmental performance for more sustainable cities.\n\nDownload our full technical specification product card by completing your details to find out more.\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Reliable Commuter Trains | Commuter Rail | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/commuter-trains/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nRolling Stock Banner Commuter (1920X600)\nCommuter Trains\nMoving people efficiently and responsibly.\n\nReliable, comfortable and designed to meet the needs of regional or outer suburban commuters. Each train is designed to move people efficiently across short to medium distances, operating through rural and urban environments. Environmental impact, noise levels and comfort are key considerations when designing the commuter rail services to ensure we can move people efficiently and responsibly.\n\nClass 385\n\nDecember 2019, saw the complete delivery of the Class 385 fleet. The fleet has carried passengers over 12 million miles and has helped transform commuter travel, not just across the routes in Central Scotland that they serve, but also across Scotland’s Railway - with more seats and shorter journey times.\n\nDesigned and built specifically to improve journeys on Scotland’s busiest routes, the trains offer a spacious and modern interior, increasing capacity with over 168 extra seats per train.\n\nThis modern, electric fleet is part of ScotRail’s £475 million rolling stock investment, and their introduction f...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nPlay\n00:00\n-00:58\nMute\nSettings\nEnter fullscreen\nPlay\n00:00\n-00:58\nMute\nSettings\nEnter fullscreen\nNext\nLaview Commuter\n\nIntroduced in 2019 as the new flagship train for Seibu Railway and named “Laview”, this iconic looking train is defined by the view through windows measuring 1,350 mm x 1,580 mm, designed to maximise viewing opportunities.\n\nThese huge, curved windows provide passengers with panoramic views along the way to enhance passenger experience and ensure a comfortable and enjoyable ride.\n\nThe train’s...\n\nRead more\nGallery\nTechnical Outline\nKey Achievements\nPrevious\nNext\nBlues Commuter\n\nThe \"Blues\" trains derive from the Masaccio platform and are equipped with diesel-electric propulsion integrated with batteries that make the train a hybrid-bimodal solution, that can also run without electrification.\n\nThese new vehicles are record-breaking in terms of performance and sustainability as they are equipped with new-generation and low-emission diesel engines (Stage V) integrated with batteries allowing emission and noise reduction.\n\nThe trains can run up to 160 km/h on electrified lines with great travel time savings.\n\nOn-board technologies include: smart air-conditioning systems capable of adapting to internal conditions such as temperature and the number of passengers on board, LED systems that contribute to save energy, video surveillance for improved safety of passengers, WiFi...\n\nRead more\nGallery\nTechnical Outline - Short Vehicle\nTechnical Outline - Long Vehicle\nRock Train\nCaravaggio - FNM\n\nCaravaggio is the new Hitachi Rail platform of high-capacity trains and are the result of the best technologies developed across the Hitachi Group. They are fully assembled in Italy and draw upon 20-years of manufacturing experience of developing over 200 electric trains and 700 passenger cars, all of which are double-deck, and in operation on the Italian rail network.\n\nThe innovative architecture, characterised by light alloy cars, well-distributed power traction and wide volumes available for the passenger compartments offers unique performance in the marketplace in terms of:\n\n- Weig...\n\nRead more\nGallery\nTechnical Outline - Short Vehicle\nTechnical Outline - Long Vehicle\nPrevious\nNext\nCaravaggio - Rock\n\nCaravaggio is the new Hitachi Rail platform of high-capacity trains and are the result of the best technologies developed across the Hitachi Group. They are fully assembled in Italy and draw upon 20-years of manufacturing experience of developing over 200 electric trains and 700 passenger cars, all of which are double-deck, and in operation on the Italian rail network.\n\nThe innovative architecture, characterised by light alloy cars, well-distributed power traction and wide volumes available for the passenger compartments offers unique performance in the marketplace in terms of:\n\n- Weig...\n\nRead more\nGallery\nETR421\nETR521\nETR621\nVivalto Commuter\n\nThe CDPTR railcars – Carrozze Doppio Piano Trasporto Regionale (double deck railcars for regional transport), called “Vivalto” by Trenitalia, is a highly innovative double-deck train characterised by comfort and enhanced user experience.\n\nThe six-car consist, five trailer cars plus one motor car, has 725 seats and, considering the additional space for standing passengers, has a total transport capacity of 1,300 passengers.\n\nThese trains can reach a maximum speed of 160 km/h. They have high levels of comfort, safet...\n\nRead more\nGallery\nPrevious\nVivalto Interni\nVivalto Interni\nVivalto Interni\nNext\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "High speed trains | High speed rail solutions | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/high-speed-trains/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nLarger Banner (1920X600) ETR 1000\nHigh Speed Trains\nGetting passengers to their destination in record time.\n\nWe have a rich heritage of technical expertise and research and development in high-speed rail - providing solutions that get passengers to their destination in the fastest time possible and with the same levels of comfort. Building on the experience and knowledge gained from over 50 years’ experience of providing the Japanese Shinkansen bullet train, the most iconic and punctual rolling stock product in the world.\n\nAT400\n\nMore than 50 years since the birth of the Shinkansen rail network in Japan, Hitachi Rail is developing the next generation of high speed rolling stock for the UK and Europe, which will be some of the fastest, most comfortable, quietest and sustainable trains ever built.\n\nUsing our rich heritage of research and development, technical expertise, plus unparalleled delivery experience, our solutions will get passengers to their destination in the fastest time possible and with the highest levels of comfort.\n\nGallery\nTechnical Outline\nPrevious\nAT400 Countryside\nAT400 2\nAT400 Countryside\nAT400 2\nAT400 Countryside\nNext\nETR1000 – Frecciarossa\n\nThe ETR1000 is the flagship high speed train manufactured by the partnership of Hitachi Rail-Bombardier in Europe, involving company participation of 60% and 40% respectively, on behalf of the Italian State Railways (Trenitalia).\n\nThis train is designed to reach a top train speed of 400 km/h and it is suitable to operate on the European network (France, Germany, Spain, Austria, Switzerland, Netherlands and Belgium), overcoming infrastructure limitations, in particular the different power supplies and several types of signalling in operation across Europe.\n\nThe aerodynamic design and state-of-the-art solutions for energy saving, ensure unmatched operational efficiency, which have awarded the ETR1000 the record of the fastest train ever mass-produced in Europe - with the best acceleration, noise-reduction, less...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nETR 1000 (5)\nETR 1000 (5)\nNext\nN700A Shinkansen\n\nThe N700A Shinkansen, started operations between Tokyo and Osaka in Japan in 2013.\n\nDeveloped by Central Japan Railway Company (JR Tokai), the trains focus on passenger safety and comfort, and are equipped with constant speed control systems, vibration detection systems and new braking systems. The new innovative systems contribute to the overall safety of operations.\n\nSimilar to the previous N700 fleet, the new N700A trains offer a number of technical improvements over their predecessors, including LED lighting (which is around 20% more efficient than the lighting system in the N700), ...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Monorail Solutions | Sustainable Transport | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/monorail-solutions/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nRolling Stock Banner Monorail (1920X600)\nMonorail Solutions\nSimple in design, environmentally friendly and providing a high level of passenger comfort.\n\nHitachi Rail monorail systems offer mass transit planners an alternative to other public transportation systems with distinctive features. Simple in design, this environmentally friendly solution provides a high level of passenger comfort and safety and has a range of system capacity. Complete monorail train systems can be developed to integrate with existing transport solutions and infrastructure, offering cost-effective solutions for easing congestion in busy city centres.\n\nTokyo Monorail\n\nThe Tokyo Monorail connects Tokyo International Airport (Haneda) to JR East’s Hamamatsucho. The monorail is operated by Tokyo Monorail Co., Ltd., which is jointly owned by JR East, Hitachi, and All Nippon Airways (ANA).\n\nThe lead trailers, which include the driving cab of the six-car train, are without a traction motor to reduce the overall weight of the train. The car body is fabricated using Friction Stir Welded Aluminium alloy panels which offer exceptional strength alongside a lightweight design.\n\nPassenger accommodation consists of a mixture of 4-seat facing bays and longitudinal bench seating, and includes luggage racks next to the doorways. LED lighting is used throughout for a welcoming and clean interior, whilst passenger information is provided by 17-inch wide LCD displays above the doorw...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nDaegu Monorail\n\nDaegu Metro Line 3, also called “Sky Rail”, is the 23.9km-long double track monorail line of Daegu Metro Transit Corporation, which operates in Daegu, South Korea. Construction started in June 2009, with operation starting in 23 April 2015, making it South Korea’s first monorail as public transit system.\n\nHitachi Rail was contracted to deliver the monorail rolling stock, track switches and the signalling system for South Korea’s first straddle-type monorail system. Unveiled in July 2013, a total of train sets comprising 84 cars run on the line. Each monorail vehicle with three carria...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Tram Systems | Rolling Stock Solutions | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/tram-systems/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nRolling Stock Banner Tram (1920X600)\nTram Systems\nEfficient solution for intensive commuter journeys.\n\nOur tram trains provide an efficient solution for short distance, intensive commuter journeys - with a top speed of 100mph they are also suitable for longer, inner suburban journeys. Our trams are a practical, environmentally friendly solution; they are simple in design and comfortable, running through restrictive busy areas.\n\nSirio Florence Tram\n\nHitachi Rail’s Sirio tram railway platform is designed with low and flat floors, allowing for easy boarding as well as good movement inside for standing passengers. With a capacity of 276 passengers, each tram features two areas equipped for people with reduced mobility for greater accessibility.\n\nThese 32-metre trams are bi-directional vehicles composed of five body cars on three bogies (two motor and one trailer). The traction system is equipped with two IGBT inverters for each motor bogie, each one controlling a single motor.\n\nThe interior layouts are reconfigurable to meet all customer requirements in terms of capacity, comfort and mode of service. The driver’s ca...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nSirio Zhuhai Tram\n\nHitachi Rail’s Sirio platform is designed with low and flat floors, allowing for easy boarding as well as good movement inside for standing passengers. The 32-metre trams have a capacity of 279 passengers, 64 of which are seated.\n\nThe interior layouts are reconfigurable to meet all customer requirements in terms of capacity, comfort and mode of service. The driver’s cab has a very broad glass in front which allows excellent visibility.\n\nThere are different types of power available, from the classic catenary, to the supercapacitors on board, to the ground power supply. The supe...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nTurin Tram\n\nThe new tram railway platform developed in Italy by Hitachi Rail is the evolution of the previous Sirio tram, and introduces innovative technologies to support performance and reliability of commercial service.\n\nThe 28-metres trams will offer a range of innovations ensuring a unique travel experience:\n\n- Bright environment and full immersion in the outside urban landscape thanks to the wide glass windows and the transparency of lateral parts of the roof of the vehicle.\n\n- Lighting and conditioning systems evenly distributed along the compartments to allow maximum comfort to the passengers.\n\n- Handrails and hanging hand grips placed throughout th...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Metro Solutions | Rolling Stock Solutions | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/metro-trains/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nLarger Banner Metro(1920X600)\nMetro Trains\nAn efficient solution for short distance, intensive commuter journeys.\n\nOur metro products provide an efficient solution for short distance, intensive commuter journeys - with a top speed of 160km/h they are also suitable for longer, inner suburban journeys. Our metro platform is modular in design, flexible and fully customisable. We also have established operation and maintenance services (O&M) and quality components starting from early stages of the project through the whole lifetime of the system.\n\nMeneghino Metro\n\nThe Meneghino Metro is equipped with an integral air conditioning system, on board an advanced audio-video information system for stop/connection announcements and an integrated passenger information system with video surveillance devices.\n\nIn addition, the structure, bogies and doors have been designed to provide a noiseless ride and coaches are fully connected to provide a unique large, comfortable and safe space for metro transit passengers.\n\nContract\n\nAfter an initial supply of 27 trains, in 2008 an additional 13 trains were ordered for a total of 40 trains. The trains are made up of six permanently coupled coaches, including two identical, functionally independent traction units, with a driver's cab at each end. Each traction unit consists of two identical motor cars and a trailer with driver's cab (Rp+M1+M2). All the coaches are intercommunicating and t...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nGenova Metro\n\nThe 39m long four-car sets have three motor and two trailer bogies and a capacity of 290 passengers plus two dedicated spaces for passengers with reduced mobility.\n\nPassenger service can be completed in a single and / or multiple configuration and there is a driver's cab at each end of the train.\n\nThese trains have the following characteristics:\n\n- Body structure in aluminium or stainless steel.- Fibreglass or light alloy furniture with easily customisable layout and design.- A propulsion system based on single or double IGBT (insulated-gate bipolar transistor) inverter and trucks equipped with two motors for line voltages 750V, 1...\n\nRead more\nGallery\nTechnical Outline\nTokyo Metro 10000\n\nThe 10000 series fleet has been designed to ensure passenger comfort and safety whilst travelling across Tokyo. Offering a clean, efficient and reliable way of commuting to work and moving across the city for tourists, a single train can accommodate over 1,500 passengers in a 10-car formation.\n\nThe 10000 series was conceived in 2004 as a new generation train that would look towards the future as well as being safer and more reliable than previous designs.\n\nThe first set entered service in September 2006; more sets were ...\n\nRead more\nGallery\nGlobal Projects\nTechnical Outline\nPrevious\nNext\nMiami Dade County Metro\n\nThe Miami Dade County Metro are modern, environmentally friendly and equipped with LED lighting with low energy consumption.\n\nInteriors include a CCTV (closed circuit television) security system, with a WiFi connection for passengers, bicycle racks, folding seats and composite floor panels fully compliant to specific Florida and U.S. requirements and standards.\n\nThe trains have the following characteristics:\n\n- Body structure in aluminium or stainless steel.- Fibreglass or light alloy furniture with easily customisable layout and design.- A propulsion system based on single or double IGBT inverter and trucks equipped with two motors for line voltages 750V, 1500V or 3000V.- TCMS (Train Control & Moni...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nMilan Metro (Leonardo Line 1/2)\n\nThese Milan Metro are composed of two equal and independent traction units (UdT) intended to serve in trains of six cars permanently coupled with a driver’s cab at both ends. The two traction units are configured as follows: a motor car “M1” with cab, a trailer car “T” and an intermediate motor car “M2”.\n\nTrains are equipped with an advanced system of video-audio information to passengers, with the possibility to share information on the network even during passenger operation. The system is also fully integrated with on-board video surveillance and diagnostics.\n\nContract\n\nIn 2012 a contract, including the delivery of 60 trains “Leonardo” for the Line 1 and Line 2 of Milan Metro, was signed with ATM. A new contract to manufacture an additional 15 “Leonardo” metro trains for the city of Milan was signed in 2017 and deliveries wer...\n\nRead more\nGallery\nTechnical Outline\nBaltimore Metro\n\nHitachi Rail has been awarded a contract from Maryland Transit Administration (MTA) to provide a new metro fleet of railcars and a Communication Based Train Control (CBTC) system for the Baltimore Metro Subway Link.\n\nThe project features 78 state-of-the-art Hitachi railcars and the replacement of the existing signalling system with an advanced CBTC system. The new Baltimore metro has been designed to be highly innovative in terms of safety, passenger comfort and design, with a 30-year life-cycle capable of providing an average metro journey journey of 80,000 miles per year.\n\nEach bi-directional vehicle has a minimum composition of two identical stainless steel cars, \"married pair\", with the ability for multiple compositions. Each car has 76 seats and a total capacity of 196 passengers. The floor structure guarantees fire resistance for at least 30 minutes, in compliance with the NFPA (National Fire Protection Association) 130 requirements. Each car is fully-motorised, with an IGBT inverter...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nFortaleza Metro\n\nIn 2009, Hitachi Rail signed a contract with SEINFRA, Secretaria da Infraestrutura do Estado do Ceará, for the delivery of 20 electric trains for Metro Fortaleza (Brazil). In 2012 the client exercised the option for the delivery of an additional five vehicles, bringing the total supply to 25 electric trains.\n\nThe trains run on the South Line, a 23km metro line connecting the city centre with Maracanaù.\n\nThe air-conditioned trains are 40...\n\nRead more\nGallery\nTechnical Outline\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Driverless Trains | Autonomous Trains | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/driverless-trains/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nRolling Stock Banner Driverless (1920X600)\nDriverless Trains\nHigh performance trains delivering a superior level of comfort and safety.\n\nDriverless metro systems combine our global excellence in design and technology. These high performance trains deliver a superior level of comfort and safety. With a modular interior, they can be customised to customer requirements for size and capacity needs. Hitachi Rail manufactures more than 30% of all driverless rolling stock products currently in operation across the world. The company's centre of excellence for driverless technology has continues to enhance the passenger experience.\n\nHonolulu\n\nThe new Honolulu metro represents a rolling stock and signalling systems project awarded to the Hitachi Rail group as a contract with HART (Honolulu Authority for Rapid Transportation) valued at over $1.3bn.\n\nThe vehicles designed by Hitachi Rail have been created to fulfil the requirements of both residents and tourists of the Hawaiian island. They have a capacity of over 800 passengers including 120 seats and 68 flip up seating options to give full flexibility.\n\nGallery\nTechnical Outline\nPrevious\nNext\nCopenhagen Cityringen M3/M4\n\nCityringen is the M3/M4 line in Copenhagen that serves 17 new stations, running in a circle for 15.5 km, connecting the areas of Vesterbro, Nørrebro, Østerbro with Frederiksberg and the historical city centre.\n\nThe system, which has a total journey length of less than 30 minutes, allows passengers to interchange with the existing M1-M2 lines at two stations. The 39 driverless metro trains, signalling and turnkey systems for the M3 line are all manufactured/delivered by Hitachi Rail in Italy.\n\nThe metro project contract - commissioned by Metroselskabet, the public entity responsible for the metro network - was signed in January 2011, with trains going into s...\n\nRead more\nGallery\nTechnical Outline:\nPrevious\nNext\nCopenhagen M1/M2 Lines\n\nThe contract with Metroselskabet, a partnership of the municipality of Copenhagen, the Danish Government and the city of Frederiksberg, for the supply of eight additional driverless trains for the M1/M2 lines of the Copenhagen Metro, was signed on 7th March 2018.\n\nAll vehicles are driverless metros, and the eight metro trains were delivered in 2020/2021 with similar features to the Cityringen vehicles, with some necessary adaptations to run on the M1/M2 lines.\n\nHitachi Rail already has a strong presence in the Danish capital. Since 2002, 34 Italian-made metro trains manufactured in Naples, Pistoia an...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nLima\n\nThis Metro train is made of aluminium with a capacity of 166 seated and 1,105 standing passengers.\n\nWith a total of of 42 vehicles in service on Line 2 and Section 4 Faucett – Gambetta, which comprise of 35 stations and 35 km of tunnels.\n\nThese Hitachi Rail metro trains have been designed with open gangways to allow free movement of passengers along the entire length of the train.\n\nApplying industry-leading excellence in design, the train has large windows throughout which, combined with ergonomically arranged seating, creates a bright and engaging passenger environment.\n\nEach car has air conditioning, new passenger information systems and new generatio...\n\nRead more\nGallery\nTechnical Outline\nMilan Line 4\n\nThe driverless and articulated metro trains can carry up to 600 passengers and have a top speed of 80 km/h, operating in both directions.\n\nIn 2015 a contract for the supply of 47 driverless trains was signed with ATM. The contract follows the signature of the agreement and the financing arrangements for Line M4 of the Milan underground.\n\nThe new underground line will link Milan's Linate Airport to San Cristoforo railway station, crossing the city centre from East to West with 15 stops over 14.5 km.\n\nAll the carriages will be produced in the plants of Pistoia and Reggio Calabria, while the ...\n\nRead more\nGallery\nTechnical Outline\nMilan Line 5\n\nThe contract with ATM for the delivery of new driverless metros for Line M5 of Milan was signed in 2006.\n\nThe contract included the delivery of 21 four-car articulated driverless trains and the first one was delivered in November 2010.\n\nA new contract for a 7km extension of the line has been awarded in 2011.\n\nThe trains are approx. 50 metres long, and have a seating capacity of 96 passengers and a maximum capacity of 438 passengers.\n\nGallery\nTechnical Outline\nRiyadh\n\nThe contract for the delivery of new driverless trains for internal transport within Princess Nora Bint Abdul Rahman University campus in Riyadh was awarded in 2009.\n\nThe contract included the supply of 22 trains, each one composed of two cars and 29 metres long. The line was inaugurated in 2011.\n\nThese driverless trains are designed to be comfortable and to offer a pleasant experience for passengers.\n\nThey provide students with access to all the main faculty buildings and accommodations. Travelling on these metros is free, although a ticketing system is in use to monitor ridership.\n\nThe line has set the record of being “the world's first metro system entirely within a un...\n\nRead more\nGallery\nTechnical Outline\nTaipei\n\nThe new driverless metro for DORTS (Department of Rapid Transit Systems) are an expression of the local Government of the Municipality of Taipei.\n\nThis represents the first turnkey system project (incorporating both the trains and all sub-systems necessary to operate the metro line) delivered by Hitachi Rail in the Far East.\n\nThe driverless system developed by Hitachi Rail for the new 15.4km line, uses Communication Based Train Control to the highest grade of automation (CBTC GoA 4) to optimise system safety, reliability and efficiency.\n\nHitachi Rail has also supplied the 17 newly-developed trains for the Taipei Circular line. Designed to achieve elevated levels of performance in terms of operation costs, passenger comfort, capacity, service availability and reliability, the 17 medium-capacity tra...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nRome\n\nThe contract with Metropolitana di Roma for the supply of driverless metros for Metro Rome Line C was awarded on February 2006 and delivery of 30 six-car driverless trains followed soon after.\n\nLine C is the first metro in Rome with a \"Driverless\" Integral Automation System, which allows the operator to manage the line automatically, ensuring maximum efficiency and safety.\n\nEach train is composed of six intercommunicating cars with 194 seats and dedicated...\n\nRead more\nGallery\nTechnical Outline\nPrevious\nNext\nThessaloniki\n\nThe contract with Attiko Metro for the design and delivery of driverless metros was signed in April 2006.\n\nThe contract outlined the delivery of 18 driverless metros to be put into service on the base line, with an option of 15 additional driverless metros to be put into service on the Kalamaria extension line.\n\nThe trains consist of four cars able to transport a total of 450 passengers. Their maximum speed is 80 km/h and they are equipped with air conditioning.\n\nGallery\nTechnical Outline\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Intercity Battery Trains | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/battery-powered-trains/intercity-battery-trains/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nIntercity Battery Trains\nHOMEPRODUCTS AND SOLUTIONSBATTERY POWERED TRAINSINTERCITY BATTERY TRAINS\nIntercity Battery Trains\nRolling Stock Solutions\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nBattery Powered Trains\nBattery Powered Trams\nBattery Commuter Trains\nIntercity Battery Trains\nBattery Intercity Train Technical Specification\nAccelerate the decarbonisation of intercity rail with batteries\n\nA quick and easy application of battery technology is to install it on existing or future Hitachi intercity trains. Hitachi Rail’s modular design means this can be done without the need to re-engineer or rebuild the train and return them to service as quickly as possible for passengers.\n\nReplacing one diesel engine with just one battery reduces emissions by more than 20% and offers cost savings of 20-30%. Our intercity battery powered trains can cover 70km on non-electrified routes, operating at intercity speeds at the same or increased performance.\n\nReduce CO2, lower noise and improve air quality at stations\n\nThe trains enter, alight and leave non-electrified stations in battery mode, reducing diesel emissions and minimising noise – helping to improve air quality and make train stations a cleaner environment for passengers. The technology charges on the move, increasing train range and reducing new infrastructure requirements.\n\nA simple way to apply battery technology is through a retrofit programme, removing diesel engines from the existing Hitachi fleet to replace with batteries providing +750kW of power each. We use batteries that have already been proven as reliable and safe in the automotive sector, and then optimise them for rail use with our partner Turntide.\n\nDecarbonising rail, one step at a time\n\nThrough phased replacement of diesel engines at the time that they would have been due for their regular heavy maintenance overhaul, operators will see immediate savings in fuel costs savings between 20-30% and a 20% reduction in whole life maintenance costs - well within the battery’s life span of 8-10 years. And, by retrofitting batteries to existing stock, we maximise asset utilisation, further contributing to a sustainable approach.\n\nRead more\n\nHitachi Rail and Turntide agreement opens way for battery trains across Britain\n\nHitachi Rail and Angel Trains to create intercity battery hybrid train on TransPennine Express\n\nHitachi and Eversholt Rail develop battery for a GWR intercity battery hybrid train trial\n\nDownload the Battery Intercity Train Technical Fact Sheet\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Battery Commuter Trains | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/battery-powered-trains/battery-commuter-trains/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nBattery Commuter Trains\nHOMEPRODUCTS AND SOLUTIONSBATTERY POWERED TRAINSBATTERY COMMUTER TRAINS\nBattery Commuter Trains\nRolling Stock Solutions\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nBattery Powered Trains\nBattery Powered Trams\nBattery Commuter Trains\nBattery Commuter Train Technical Specification\nIntercity Battery Trains\nAccelerate the decarbonisation of rail with flexible battery technologies\n\nOur battery powered commuter trains – whether full battery, “hybrid” battery-electric or “tri-brid” battery-electric-diesel - are designed with reliability, sustainability, and efficiency in mind.\n\nThis new generation of hybrid technology brings improved performance across the fleet – lower CO2 output, up to 50% reduction in fuel consumption, lower noise, reduced journey times, and increased ranges with flexible, scalable battery capacity. Capable of running on both electrified and unelectrified railway lines, these battery powered trains offer greater flexibility for fleet management on regional lines with little to no impact on the existing railway infrastructure.\n\nFull battery, electric-battery hybrid, and diesel electric battery ‘tri-brid’\n\nAnd, they deliver greater environmental performance. Using our tri-brid retrofit technology, adding battery power can offer additional power when its needed, or contribute to reducing fuel costs and consumption by up to 50%. One such example is Hitachi Rail’s “Blues” commuter train in Italy, which derives from the Masaccio platform and is equipped with diesel-electric propulsion integrated with batteries that can also run without electrification.\n\nThe Masaccio Single Deck can be configured with two, four or full battery packs with flexible and scalable battery capacity, installed underframe, and with cooling systems in the roof. The lithium-ion battery cells are modular, with high-rate charging capability, low temperature performance and charge/discharge efficiency.\n\nFully Charged: Rapid charging technology will charge a train faster than your smartphone\n\nPlus, with the Masaccio Full Battery solution, operators benefit from real-time data analysis and super-fast charging time. Hitachi Rail’s battery management system interfaces directly with the vehicle bus and measures the cell voltage and temperature, to balance usage across the cells. The technology offers full battery recharge from one pantograph in traction phase, and from two pantographs in under 10 minutes at terminal stations.\n\nRead more\n\nItaly's Urban Blues – read the case study on Europe’s first battery-hybrid train\n\nWorld first in Battery Trains – read the case study on Japan’s DENCHA railway\n\nDownload the Battery Commuter Train Technical Fact Sheet\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Battery Powered Trams | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/battery-powered-trains/battery-powered-trams/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nBattery Powered Trams\nHOMEPRODUCTS AND SOLUTIONSBATTERY POWERED TRAINSBATTERY POWERED TRAMS\nBattery Powered Trams\nRolling Stock Solutions\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nBattery Powered Trains\nBattery Powered Trams\nBattery Tram Technical Specification\nBattery Commuter Trains\nIntercity Battery Trains\nModern Battery Technology respects Historic City Centres\n\nHitachi Rail’s battery-powered tram technology offers the major benefit of requiring no electrified infrastructure. Our trams can operate on sections of routes with no overhead wires, such as historic city centres, like Florence, Italy, and offer range increase of up to 5km.\n\nThis “catenary-free” operation uses modular architecture and the latest generation lithium-ion batteries to ensure best in class performance, as well a DC/DC converter to provide controlled battery charging.\n\nRetrofittable battery technology can improve sustainability in city centres\n\nIt’s flexible too. The new technology is based on an onboard energy storage system (OBESS), with scalable battery capacity. It can be installed directly on the roof of existing trams - saving on costs, and visual impact – all while ensuring better environmental performance for a more sustainable society.\n\nIn Florence, battery powered trams have been tested since 2021. Fitted to trams on the existing Sirio fleet, the battery technology enables the trams to operate on a section of the line entirely under battery power, without the use of overhead infrastructure. Power is returned to the batteries when the train brakes, reducing the overall amount of energy consumed and protecting Florence’s historic environment.\n\nRead more\n\nModern Transport for Historic Florence – read the case study on Italy’s first battery tram\n\nDownload the Battery Powered Tram Technical Fact Sheet\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Battery Powered Trains | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/battery-powered-trains/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nDENCHA Train 01\nBattery Powered Trains\nBattery Trains: Cleaner, Quieter and Cost Effective.\n\nBattery trains reduce carbon emissions and noise, improve air quality at stations, lower maintenance costs and enable flexibility on electrification, minimising passenger disruption during upgrades. As a retrofittable technology with the potential to start small and scale later, it’s the clear sustainable choice for decarbonisation. And, with the fast pace of development, batteries are future-proofed for the expected increases in range, improving their performance.\n\nFlorence Tram 01\nBattery Powered Trams\n\nLearn more\nBlues Train 01\nBattery Commuter Trains\n\nLearn more\nAT300 Intercity 03 (1)\nIntercity Battery Trains\n\nLearn more\nAccelerate the decarbonisation of rail\n\nCombining forces as part of the broader Hitachi Group, we are pioneering sustainable decarbonisation solutions across the entire battery lifecycle to help cities, governments and operators cut carbon in the mobility sector. Whether train operators want to deploy full battery, “hybrid” battery-electric or “tri-brid” battery-electric-diesel trains, our battery enabled trains and charging solutions offer a fast track for operators looking to affordably meet their environmental goals.\n\nBattery Powered Trams\n\nHitachi Rail’s battery-powered tram technology offers the major benefit of requiring no electrified infrastructure. Our trams can operate on sections of routes with no overhead wires, such as historic city centres, and offer range increase of up to 5km.\n\nLearn More\nDownload Product Data Sheet\n\nBattery Commuter Trains\n\nOur battery powered commuter trains – whether full battery, “hybrid” battery-electric or “tri-brid” battery-electric-diesel - are designed with reliability, sustainability, and efficiency in mind. This new generation of battery hybrid technology brings improved performance across the fleet – lower CO2 output, up to 50% reduction in fuel consumption, lower noise, reduced journey times, and additional power over normal performance.\n\nLearn More\nDownload Product Data Sheet\n\nIntercity Battery Trains\n\nOur intercity battery powered trains can cover 70km on non-electrified routes, operating at intercity speeds at the same or increased performance. Hitachi Rail’s modular design means this can be done without the need to re-engineer or rebuild the train and return them to service as quickly as possible for passengers.\n\nLearn More\nDownload Product Data Sheet\n\nFurther Reading\nCross-Sector Expertise in Battery Trains and Energy\nDecarbonisation: A New Approach to Carbon Measurement\nThree ways Hitachi Rail is becoming a climate change innovator\nWhy we are Backing Batteries for the Green Revolution of rail\nDownload the Masaccio Technical Fact Sheet\nBattery Train Technical Specification\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Ticketing & Payment | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/ticketing-payment/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nTicketing & Payment\nHOMEPRODUCTS AND SOLUTIONSTICKETING & PAYMENT\nTicketing & Payment\nRolling Stock Solutions\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nBattery Powered Trains\nTo drive the modal shift from cars to public transport, all modes of public transport have to be more convenient and better connected.\n\nToday’s passengers want easy ways to combine different modes of transport, public or private, to create their ideal door-to-door journey – not just using buses and metros, but also first mile/last mile micro-mobility modes, such as scooters, ride hailing or park & ride options.\n\nMore importantly, they want an integrated and equitable “best fare” that covers the whole journey (city, region country wide) – and a convenient way of paying for everything, preferably their smartphone.\n\nHitachi Rail’s ticketing and payment solutions are scalable at city, region or nationwide level and can integrate several modes of transport such as bus, trams, ferries, metro, mainlines, and private mobility services to deliver a unified travelling and payment experience.\n\nPublic transport operators, authorities and cities rely on Hitachi Rail for turnkey interoperable (multi-modal and multi-operator) ticketing and payment solutions for city, regional or nationwide schemes.\n\nOur solutions facilitate several ticketing options such as card centric and account based ticketing, open loop EMV and closed loop tokens for every type of user. We offer fully digitalized solutions as well as physical options for the inclusion on non-digital travellers. Hitachi Rail provides future proofed ticketing solutions for public transport operators and authorities for greenfield and brownfield metro and train services to increase ridership and improve customer experience.\n\nOur offering includes:\n\nMulti-operator and multi-modal ticketing backoffice\n\nNetwork, topology and fare integration and migration\n\nOpen loop EMV ticketing, card - or account based ticketing\n\nFinancial clearing and settlement\n\nPhysical and digital card production and personalisation\n\nOnline customer (self) services\n\n“Hands-Free” ticketing via Bluetooth smartphone connection\n\nLong term managed services\n\nParking solutions including payment for parking and EV charging\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Freight Rail Control & Supervision | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/freight-rail-control-supervision/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nFreight Rail Control & Supervision\nHOMEPRODUCTS AND SOLUTIONSFREIGHT RAIL CONTROL & SUPERVISION\nFreight Rail Control & Supervision\nRolling Stock Solutions\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nBattery Powered Trains\nToday's world is defined by volatile supply chains, ever-more demanding customers and a need to deliver freight to the right place at the right time – for the optimal operating cost.\n\nHitachi Rail’s experience in delivering proven, reliable technologies to the global freight market is helping freight customers to ensure reliable, cost efficient, and effective commercial railways.\n\nHitachi rail can ensure the best and competitive solutions to manage and satisfy clients’ needs. From individual onboard and wayside components to fully automated AI-enabled railway systems, Hitachi Rail is able to help freight customers to deliver the goods.\n\nHitachi Rail’s experience in the rail freight market dates back to George Westinghouse’s Union Switch and Signal business, established in the USA in 1881. Hitachi Rail supports customers on freight railways worldwide, including the USA, Canada, the Middle East, India and Australia.\n\nWith new digital solutions and technologies, such as ETCS and digital asset management, Hitachi Rail’s freight rail signalling offer helps our customers to improve safety, efficiency and enhance the commercial operations of their railways.\n\nOur offering covers supply and full system integration including:\n\nAutomated freight railroad solutions (GOA4)\n\nOperating Control Centres including Traffic Management and network optimisation.\n\nConventional on board and way side signalling\n\nPositive Train Control and Temporary Speed Restriction Management\n\nTelecoms, including Satellite GNSS for ETCS\n\nTelecoms\n\nInterlocking\n\nWayside Train Separation\n\nOperations\n\nService & Maintenance\n\nDigital Asset Management\n\nComponents\n\nCybersecurity\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Mainline Rail Control & Supervision | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/mainline-rail-control-supervision/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nMainline Rail Control & Supervision\nHOMEPRODUCTS AND SOLUTIONSMAINLINE RAIL CONTROL & SUPERVISION\nMainline Rail Control & Supervision\nRolling Stock Solutions\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nBattery Powered Trains\nMainline railway operators are under pressure to offer safer, more reliable and smoother journeys to their passengers than ever before.\n\nWhether operators are looking to increase capacity, frequency or reliability of their networks, Hitachi Rail’s innovative technologies can help to improve performance while reducing operating and maintenance costs.\n\nAt Hitachi Rail, we provide mainline solutions to regional and national rail networks across the world. Our wide range of rail solutions can revitalise existing rail networks or deliver state of the art greenfield installations. Whether it is a signalling solution, fare collection management, integrated communications system or a traffic management system, our experts work with our customers to prepare their infrastructure for the transport and technological needs of today and tomorrow.\n\nWe are proud to have been a founding member of Shift2Rail, now Europe’s Rail Joint Undertaking, the European initiative developing digital innovation and designing the future European rail systems such as ETCS. Having delivered over 26,000km of main line railway signalling systems around the world, Hitachi Rail is best positioned to support any mainline customer in optimising their network.\n\nHitachi Rail offers a complete portfolio of ETCS solutions for turnkey projects in the same way as for green field or brown field installations. We offer cyber security and special functionalities in compliance with international specifications. These include Driver Advisory Systems, Automatic Train Operation, IP-based radio communication and advanced diagnostics. Hitachi Rail delivers cutting-edge signalling and traffic management systems that can span seamlessly across national borders. Our global offering covers the full spectrum of safety and none safety critical components of signalling and traffic management systems.\n\nOur offering of supply and full system integration includes:\n\nERTMS Systems\n\nETCS Signalling\n\nAutomatic Train Operation over ETCS\n\nOperations Control Centres including Traffic Management and network optimisation for conventional and ERTMS systems.\n\nConventional on board and way side signalling\n\nTelecoms, including Satellite GNSS for ETCS\n\nInterlocking\n\nWayside Train Separation\n\nOperations\n\nService & Maintenance\n\nDigital Asset Management\n\nComponents\n\nCybersecurity\n\nRolling stock\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Urban Rail Control & Supervision | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/urban-rail-control-supervision/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nUrban Rail Control & Supervision\nHOMEPRODUCTS AND SOLUTIONSURBAN RAIL CONTROL & SUPERVISION\nUrban Rail Control & Supervision\nRolling Stock Solutions\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nBattery Powered Trains\nMore people than ever are living in cities: over 4.4 billion people around the world – expected to rise to 7 out of 10 people by 2050.\n\nAs the populations of our cities grow, so too is demand for more convenience and sustainable transportation. As a result, policy makers and transport operators are faced with challenging decisions to reduce congestion, alleviate air pollution, and deliver better connected services to improve passenger journeys.\n\nWhether it’s delivering a full turnkey metro system, or increasing the capacity of an existing network, Hitachi Rail works as a trusted partner to help its customers to improve the safety, availability and reliability of new and existing urban railways – improving passenger experience and helping operators to optimise costs.\n\nTransport networks across the world rely on our technologies and expertise to ensure safer and more efficient passenger journeys. Hitachi Rail has delivered rail solutions across more than 4,600km of urban railways around the globe.\n\nWhether it’s for tram, monorail, metros and driver operated or driverless metro systems, Hitachi Rail offers advanced, state-of-the-art technology for both new (greenfield) and existing (brownfield) infrastructure. Hitachi Rail’s capabilities range from full turnkey design, to manufacturing, installation and commissioning of rolling stock, to digital signalling telecommunications and supervision systems. Our interoperable ticketing and payment solutions for public transport authorities accelerate the shift from (private) car-based mobility to public transportation, increasing city attractiveness and accessibility.\n\nFor operators, we offer operations management and maintenance competencies, ensuring complete operations and maintenance of any type of urban solution leveraging our Asset Management Solution, designed to bring insights that drive outcomes like greater availability, reliability and lower operating costs. Our accessible data analytics modules are compliant to the latest cyber standards, helping operators to deliver more reliable, faster and more sustainable journeys for their passengers.\n\nOur full turnkey systems offering includes:\n\nCommunications-Based Train Control (CBTC) Signalling systems\n\nSmart Rail Operation Systems including Operations Control Centre, Automatic Train Stop & SCADA\n\nPassenger Mobility and Video Security Systems (Station & Onboard)\n\nTelecoms\n\nInterlocking\n\nTicketing & Payment\n\nService & Maintenance\n\nDigital Asset Management\n\nDriver Advisory Systems\n\nCybersecurity\n\nData Analytics Platform\n\nRolling Stock for Light and Heavy Metro, Tramways and Monorail\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Global I Rolling stock solutions | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/rolling-stock/",
    "html": "Search\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nRolling Stock (1920X600)\nRolling Stock Solutions\nWe have over 170 years experience of delivering rolling stock in railways for our customers and their passengers\n\nAs the populations of our cities grow, so too does the demand for better connected public transportation – and more comfortable, punctual and reliable trains. Hitachi Rail’s full portfolio of energy efficient and sustainable rolling stock is fully equipped with integrated digital asset management solutions, to help operators improve performance and lower maintenance costs.\n\nRolling Stock Thumb Commuter (260X162)\nCommuter Trains\n\nReliable, comfortable and designed to meet the needs of regional or outer suburban commuters.\n\nLearn more\nRolling Stock Thumb Tram (260X162)\nTram Systems\n\nOur tram products provide an efficient solution for short distance, intensive commuter journeys.\n\nLearn more\nRolling Stock Thumb Driverless (260X162)\nDriverless Trains\n\nThese high performing trains, bring together our global excellence in design and technology.\n\nLearn more\nLarger Banner (1920X600) ETR 1000 (1)\nHigh Speed Trains\n\nOur high speed trains provide solutions that get passengers to their destination in the fastest time possible.\n\nLearn more\nRolling Stock Thumb Intercity (260X162)\nIntercity Trains\n\nOur intercity trains are designed to get passengers to their destination in comfort and style.\n\nLearn more\nIn Page Thumbnail Small Metro (290X162)\nMetro Trains\n\nOur metro products provide an efficient solution for short distance, intensive commuter journeys.\n\nLearn more\nRolling Stock Thumb Monorail (260X162)\nMonorail Solutions\n\nSimple in design, our environmentally friendly solutions provide high level of passenger comfort and safety.\n\nLearn more\nRolling Stock Thumb Battery (260X162)\nBattery Powered Trains\n\nBattery power is the future. It is the cleanest zero–emission solution to start achieving climate change targets.\n\nLearn more\nBetter Connected Public Transportation\n\nWith over 170 years of engineering excellence and our commitment to innovation, Hitachi Rail works in partnership with its customers to improve passenger experience across its rolling stock portfolio. As a leading rolling stock manufacturer, Hitachi Rail believes that design should be accessible to all: it should impact society in a positive way and make a change within people’s daily lives, and respect sustainability across a train’s full life cycle.\n\nWith a rich history that includes the manufacturing of the iconic Japanese Shinkansen bullet train and Europe’s first passenger battery hybrid trains, Hitachi Rail is helping its customers to deliver the next phase of the mobility transition. Hitachi Rail’s commitment to quality and sustainability is evident from the design to the maintenance services and the pursuit of smarter, more energy efficient trains.\n\n \nFurther reading\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nSustainable Battery Solutions for Railway Operators\nBattery Powered Trains\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  },
  {
    "title": "Rail solutions | Transit solutions | Hitachi Rail",
    "url": "https://www.hitachirail.com/products-and-solutions/",
    "html": "EN\nIT\nSearch\nGlobal\nHitachi Group Product & Services\nHitachi Group Corporate Information\nOur CompanyProducts and SolutionsCase StudiesCareersCSR and SustainabilityPress ReleasesBlogContact\nSignalling Product Support\nPage Header Template Mission Vision & Values\nProducts and Solutions\n170 years+ of delighting our customers and their passengers\n\nHitachi Rail is a leading partner to the world’s best transportation companies, with a comprehensive portfolio of rail solutions and services for the urban, mainline and freight railway markets.\n\nRolling Stock Solutions\nUrban Rail Control & Supervision\nMainline Rail Control & Supervision\nFreight Rail Control & Supervision\nTicketing & Payment\nRolling Stock Solutions\nRolling Stock Thumb Driverless (260X162)\nDriverless Trains\n\nThese high performing trains, bring together our global excellence in design and technology.\n\nLearn more\nIn Page Thumbnail Small Metro (290X162)\nMetro Trains\n\nOur metro products provide an efficient solution for short distance, intensive commuter journeys.\n\nLearn more\nRolling Stock Thumb Tram (260X162)\nTram Systems\n\nOur tram products provide an efficient solution for short distance, intensive commuter journeys.\n\nLearn more\nRolling Stock Thumb Monorail (260X162)\nMonorail Solutions\n\nSimple in design, our environmentally friendly solutions provide high level of passenger comfort and safety.\n\nLearn more\nRolling Stock Thumb Commuter (260X162)\nCommuter Trains\n\nReliable, comfortable and designed to meet the needs of regional or outer suburban commuters.\n\nLearn more\nRolling Stock Thumb Intercity (260X162)\nIntercity Trains\n\nOur intercity trains are designed to get passengers to their destination in comfort and style.\n\nLearn more\nLarger Banner (1920X600) ETR 1000 (1)\nHigh Speed Trains\n\nOur high speed trains provide solutions that get passengers to their destination in the fastest time possible.\n\nLearn more\nRolling Stock Thumb Battery (260X162)\nBattery Powered Trains\n\nBattery power is the future. It is the cleanest zero–emission solution to start achieving climate change targets.\n\nLearn more\nView our global rolling stock portfolio...\nUrban Rail Control & Supervision\n\nHitachi Rail offers state-of-the-art solutions for new (greenfield) and existing (brownfield) urban railways including tram, monorail, driver operated or fully driverless metros. Full turnkey solutions, maintenance and operations including crew management and rolling stock.\n\nHow Hitachi Rail can support your urban signalling requirements\nUrban\nUrban Rail Control & Supervision\nLearn more\nMainline Rail Control & Supervision\n\nHitachi Rail provides mainline signalling solutions to regional and national rail networks across the world, from digital signalling to fare collection management, and integrated communications & supervision systems.\n\nHow Hitachi Rail can support your mainline signalling requirements\nPicture20\nMainline Rail Control & Supervision\nLearn more\nFreight Rail Control & Supervision\n\nHitachi Rail can ensure the best and competitive solutions to manage and satisfy freight clients’ needs, from individual onboard and wayside components to automated AI-enabled railway systems.\n\nHow Hitachi Rail can support your freight requirements\nFreight Train, NA\nFreight Rail Control & Supervision\nLearn more\nTicketing & Payment\n\nHitachi Rail’s ticketing and payment solutions are scalable at city, region or nationwide level and can support several modes of transport such as bus, trams, ferries, metro, mainlines, and private mobility services to deliver a unified travelling and payment experience.\n\nHow Hitachi Rail can support your ticketing & payment requirements\nSmart Mobility 360\nTicketing & Payment\nLearn more\nHitachi Rail's Global Product Portfolio\n\nHitachi Rail is a leading partner to the world’s best transportation companies, with a comprehensive portfolio of rail solutions and services for the urban, mainline and freight railway markets. Hitachi Rail’s portfolio includes rolling stock, signalling, telecommunications, supervision, ticketing and payment solutions for multi-modal mobility. As a trusted partner, experienced in leading and partnering in consortia, Hitachi Rail offers components to systems integration and new whole railways (full turnkey solutions), including operations, service and maintenance. With pioneering digital solutions that can help operators to connect, analyse and optimise their services across the full life cycle of a railway, Hitachi Rail is ready to help its customers to move passengers and freight more seamlessly and sustainably.\n\nOur Company\nRail Products and Solutions\nSuppliers\nCareers\nPress and Media\nSitemap\nTwitter\nLinkedin\nYoutube\nGlassdoor\nInstagram\n© Hitachi Rail Limited 2024. All rights reserved. 2024. All rights reserved.\nAccessibility\nPrivacy Notice\nModern Slavery Statement 2023\nSignalling Product Support\nGlobal Hitachi Site\nCookie Notice\nOur use of cookies\n\nWe use cookies to make the site work and help us make it better. By clicking accept, we'll set recommended analytics cookies. Or, you can ignore or close this message and we'll set only the recommended ones.\n\nAcceptRejectSettings"
  }
]